#!/bin/bash

echo "- Обновляем параметры системы"

#TODO: отключить бумажник

#TODO: добавляем цикличность для виртуальных рабочих столов

# убрать галочку у "прокручивтаь обои рабочгео стола"

#в блоке "края экрана" отключаем лишние действия и даем возможность перетаскивать приложения между ними

# change power settings (config)
# change sleep background (time to slep)
# remove blocked screen

# Ставим уведомления в правый нижний угол 



# org.freedesktop.impl.portal.desktop.kde
# Параметры всплывающих системных окон
# - параметры окон: виртуальные рабочие столы (принудительно) - все рабочие столы
# - все виды окон
# - удерживать ниже других окон (принудительно) - да
# в krohnkite - добавляем класс org.freedesktop.impl.portal.desktop.kde и для летающего окна, и для игнорируемого