#!/bin/bash

echo "- Обновляем Happ"

# Настройка прокси для приложений (идут напрямую)
# - steam
# - steamservice (не нашел)
# - steamwebhelper
# - wine64-preloader
# - gameoverlayui
# - TODO: PathOfExileSteam
# - TODO: poe2

#TODO: подумать, мб можно как-то унифицировать эту историю ГЛОБАЛЬНО через регулярки аля steam_app_.*

#TODO: подумать над ОТДЕЛЬНОЙ кнопкой, чтобы исключать рос. сайты из белых списков и тд (или кнопкой быстро, или выгружать список легальных/нелегальных сайтов через github)